jumpseller-api/app/controllers/attributes_controller.rb

  def index
    @attributes = Attribute.all
---
SELECT "attributes".* FROM "attributes"

  def create
    @attribute = Attribute.new(attribute_params)

    if @attribute.save
---
INSERT INTO "attributes" ("name", "desc", "created_at", "updated_at", "options") VALUES (?, ?, ?, ?, ?)  [["name", "Size"], ["desc", "Size of the item"], ["created_at", "2022-12-09 11:01:22.871583"], ["updated_at", "2022-12-09 11:01:22.871583"], ["options", nil]]

  def destroy
    @attribute.destroy
---
DELETE FROM "attributes" WHERE "attributes"."id" = ?  [["id", 1]]

    def set_attribute
      @attribute = Attribute.find(params[:id])
---
SELECT "attributes".* FROM "attributes" WHERE "attributes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]