jumpseller-api/app/controllers/categories_controller.rb

INSERT INTO "categories" ("name", "desc", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Test"], ["desc", nil], ["created_at", "2022-12-09 02:39:46.663420"], ["updated_at", "2022-12-09 02:39:46.663420"]]
---
  def create
    @category = Category.new(category_params)

    if @category.save