jumpseller-api/app/controllers/orders_controller.rb

  def create
    @order = Order.new(order_params)

    if @order.save
      for a in 0..(order_items_params[:ids].length() - 1) do
        @order_item = OrderItem.new(product_id:order_items_params[:ids][a],quantity:order_items_params[:quantity][a],order_id:@order.id)
        @order_item.save
---
INSERT INTO "orders" ("user_id", "total", "shipping", "status", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
INSERT INTO "order_items" ("product_id", "quantity", "order_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["product_id", 9], ["quantity", 1], ["order_id", 2], ["created_at", "2022-12-23 15:06:04.566322"], ["updated_at", "2022-12-23 15:06:04.566322"]]

  def totalRevenue
    @orders = Order.all
    @totalRevenue = 0.0

    @orders.each do |order|
---
SELECT "orders".* FROM "orders"