jumpseller-api/app/controllers/products_controller.rb

  def popular_products
    @products = Product.where(popular: true, active: true).find_each
---
SELECT "products".* FROM "products" WHERE "products"."popular" = ? AND "products"."active" = ? ORDER BY "products"."id" ASC LIMIT ?  [["popular", 1], ["active", 1], ["LIMIT", 1000]]

  def products_by_category
    @category = Category.find(params[:cat])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def create
    @product = Product.new(product_params)
    category_params[:ids].each do |c|
      @category = Category.find(c)
      @product.categories << @category
    end

    tag_params[:ids].each do |t|
      @tag = Tag.find(t)
      @product.tags << @tag
    end

    attribute_params[:ids].each do |a|
      @attribute = Attribute.find(a)
      @product.product_attributes << @attribute
    end

    if @product.save
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
INSERT INTO "products" ("name", "short_desc", "des", "price", "ship_price", "stock", "tax", "sku", "active", "img", "created_at", "updated_at", "popular") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
SELECT "attributes".* FROM "attributes" WHERE "attributes"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]

  def update
    if @product.update(product_params)
---
UPDATE "products" SET "price" = ?, "sku" = ?, "active" = ?, "updated_at" = ?, "popular" = ? WHERE "products"."id" = ?  [["price", "2179.00"], ["sku", "17382pos"], ["active", 0], ["updated_at", "2023-01-03 18:32:19.499532"], ["popular", 0], ["id", 9]]