jumpseller-api/app/controllers/tags_controller.rb

  def create
    @tag = Tag.new(tag_params)

    if @tag.save
---
INSERT INTO "tags" ("name", "desc", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Bass"], ["desc", "Bass collection"], ["created_at", "2022-12-09 02:24:13.811533"], ["updated_at", "2022-12-09 02:24:13.811533"]]